<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{

    public function up(): void
    {
        $appConfigData =[
              [
                  "key" => "membership.duration",
                  "value"=>"سنة,سنتان"
              ],
              [
                "key" => "country",
                "value"=>"أندورا, الإمارات العربية المتحدة, أفغانستان, أنتيغوا وباربودا, أنغولا, الأرجنتين, أرمينيا, أستراليا, النمسا, أذربيجان, جزر البهاما, البحرين, بنغلاديش, بربادوس, بيلاروسيا, بلجيكا, بليز, بنين, بوتان, بوليفيا, البوسنة والهرسك, بوتسوانا, البرازيل, بروناي, بلغاريا, بوركينا فاسو, بوروندي, كمبوديا, الكاميرون, كندا, الرأس الأخضر, تشاد, تشيلي, الصين, كولومبيا, جزر القمر, الكونغو, كوستاريكا, كرواتيا, كوبا, قبرص, التشيك, الدنمارك, جيبوتي, دومينيكا, جمهورية الدومينيكان, الإكوادور, مصر, السلفادور, غينيا الاستوائية, إريتريا, إستونيا, إسواتيني, إثيوبيا, فيجي, فنلندا, فرنسا, الغابون, غامبيا, جورجيا, ألمانيا, غانا, اليونان, غرينادا, غواتيمالا, غينيا, غينيا بيساو, غيانا, هايتي, هندوراس, المجر, آيسلندا, الهند, إندونيسيا, إيران, العراق, أيرلندا, إسرائيل, إيطاليا, ساحل العاج, جامايكا, اليابان, الأردن, كازاخستان, كينيا, كيريباتي, كوريا الشمالية, كوريا الجنوبية, الكويت, قيرغيزستان, لاوس, لاتفيا, لبنان, ليسوتو, ليبيريا, ليبيا, ليختنشتاين, ليتوانيا, لوكسمبورغ, مدغشقر, مالاوي, ماليزيا, المالديف, مالي, مالطا, جزر مارشال, موريتانيا, موريشيوس, المكسيك, ميكرونيزيا, مولدوفا, موناكو, منغوليا, الجبل الأسود, المغرب, موزمبيق, ميانمار, ناميبيا, ناورو, نيبال, هولندا, نيوزيلندا, نيكاراغوا, النيجر, نيجيريا, مقدونيا الشمالية, النرويج, عمان, باكستان, بالاو, فلسطين, بنما, بابوا غينيا الجديدة, باراغواي, بيرو, الفلبين, بولندا, البرتغال, قطر, رومانيا, روسيا, رواندا, سانت كيتس ونيفيس, سانت لوسيا, سانت فنسنت وجزر غرينادين, ساموا, سان مارينو, ساو تومي وبرينسيبي, السعودية, السنغال, صربيا, سيشيل, سيراليون, سنغافورة, سلوفاكيا, سلوفينيا, جزر سليمان, الصومال, جنوب أفريقيا, إسبانيا, سريلانكا, السودان, سورينام, السويد, سويسرا, سوريا, تايوان, طاجيكستان, تنزانيا, تايلاند, تيمور الشرقية, توغو, تونغا, ترينيداد وتوباغو, تونس, تركيا, تركمانستان, توفالو, أوغندا, أوكرانيا, الإمارات العربية المتحدة, المملكة المتحدة, الولايات المتحدة, أوروغواي, أوزبكستان, فانواتو, الفاتيكان, فنزويلا, فيتنام, اليمن, زامبيا, زيمبابوي"
              ],
            [
                "key" => "membership.contact_type",
                "value"=>"البرید الإلكتروني, الموبایل, الواتساب"
            ],
            [
                "key" => "consultation.scope_of_work",
                "value"=>"تأسیس, تطویر, تحلیل, قیاس, إشراف, أخرى"
            ],
            [
                "key" => "consultation.job_position",
                "value"=>"رئیس مجلس إدارة, مدیر عام, مدیر تنفیذي, مدیر إدارة, مؤسس, آخر"
            ],
            [
                "key" => "consultation.org_status",
                "value"=>"قائمة, تحت التأسیس, مشروع جدید"
            ],
            [
                "key" => "consultation.org_type",
                "value"=>"حكومیة, خاصة, حزبیة, خیریة, نفع عام"
            ],
            [
                "key" => "consultation.means_type",
                "value"=>"قناة تلفزیونیة, إذاعة مسموعة, موقع إلكتروني, منصات تواصل اجتماعي, متعددة"
            ],
            [
                "key" => "consultation.employees_number",
                "value"=>"أقل من ,٥٠ ,١٠٠-٥٠ ,٢٠٠-١٠١ ,٥٠٠-٢٠١ ,١٠٠٠-٥٠١ ,٢٠٠٠-١٠٠١ أكثر من ٢٠٠٠"
            ],
            [
                "key" => "consultation.external_offices_number",
                "value"=>"لا یوجد, ,٥-١ ,١٠-٦ ,٢٠-١١ أكثر من ٢٠"
            ],
            [
                "key" => "consultation.annual_budget",
                "value"=>"أقـل مـن مـلیون,$ ٥-١ مـلیون,$ ١٠-٦ مـلیون,$ ٢٠-١١ مـلیون,$ ٥٠-٢١ مـلیون,$
١٠٠-٥١ ملیون,$ ٢٠٠-١٠١ ملیون, ٥٠٠-٢٠١ ملیون,$ أكثر من ٥٠٠ ملیون$"
            ],
            [
                "key" => "consultation.suffers_area",
                "value"=>"تحریریة, إداریة, مالیة, تسویقیة, أخرى"
            ],
            [
                "key" => "event.specialization",
                "value"=>"تخطیط, إدارة, أخرى"
            ],
            [
                "key" => "event.presentation_format",
                "value"=>"عن بعد , حضوريا, فردية , أضافيه"
            ],
            [
                "key" => "study.specialization",
                "value"=>"إعلام, اتصال مؤسسي, آخر"
            ],
            [
                "key" => "event.org_type",
                "value"=>"علامیة, غیر إعلامیة"
            ],
            [
                "key" => "opinion_measurements.duration",
                "value"=>"المؤسسة, المحتوى, الوصول للمشاھد, التأثیر, القدرة على التغییر, أخرى"
            ],
            [
                "key" => "opinion_measurements.targeted_segment",
                "value"=>"قائمة: الجمھور العام, الشباب, المرأة, الطلاب, أخرى"
            ],
            [
                "key" => "opinion_measurements.geographical_scope",
                "value"=>"قائمة: جمیع الدول العربیة, إقلیم عربي, دولة عربیة واحدة, أخرى"
            ],
            [
                "key" => "forums.domain",
                "value"=>"قائمة: التخطیط, الإدارة, الإنتاج, المحتوى, المؤسسات, سیاسات التحریر, أخرى"
            ],
            [
                "key" => "news.field",
                "value"=>"استشارات, تدریب, محاضرات, دراسات, اتفاقیات, لقاءات, زیارات, أخرى"
            ],
            [
                "key" => "news.field",
                "value"=>"فردیة, عدة أشخاص, حدث"
            ]
        ];
        \DB::table('app_configs')->insert($appConfigData);
    }


    public function down(): void
    {
        \DB::table('app_configs')->delete();
    }
};
